Repository: LeXofLeviafan/buku
Catalog: bukuserver/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Input required.
ru: Введите данные.

source: equals
ru: равняется

source: not equals
ru: не равняется

source: contains
ru: содержит

source: not contains
ru: не содержит

source: greater than
ru: больше чем

source: smaller than
ru: меньше чем

source: in list
ru: в списке

source: not in list
ru: не в списке

source: top X
ru: первые X

source: bottom X
ru: последние X

source: natural
ru: естественный

source: reversed
ru: обратный

source: The value must be a string.
ru: Значение должно быть строкой.

source: Invalid input.
ru: Некорректный ввод

source: Keywords
ru: Ключевые слова

source: Match all keywords
ru: Все подстроки должны совпасть

source: Exclude partial matches (with multiple keywords)
ru: Исключить частичные совпадения (при поиске более одной подстроки)

source: With markers
ru: С маркерами

source: The search string will be split into multiple keywords, each will be applied to a field based on prefix:
ru: Строка поиска разбивается на подстроки, применяемые к полям в зависимости от префикса:

source: - keywords starting with '.', '>' or ':' will be searched for in title, description and URL respectively
ru: - подстроки начинающиеся с '.', '>' или ':' ищутся в названии, описании и ссылке соответственно

source: - '#' will be searched for in tags (comma-separated, partial matches; not affected by Deep Search)
ru: - '#' ищется в тегах (через запятую, частичные совпадения; «глубокий поиск» игнорируется)

source: - '#,' is the same but will match FULL tags only
ru: - '#,' работает так же но проверяет теги на ПОЛНОЕ совпадение

source: - '*' will be searched for in all fields (this prefix can be omitted in the 1st keyword)
ru: - '*' будет искаться во всех полях (этот префикс можно опустить в 1-й подстроке)

source: Keywords need to be separated by placing spaces before the prefix.
ru: Подстроки нужно разделять пробелом перед префиксом.

source: Deep search
ru: Глубокий поиск

source: When unset, only FULL words will be matched.
ru: Если это не выбрано, слова проверяются только на ПОЛНОЕ совпадение.

source: Regex
ru: Регулярное выражение

source: The keyword(s) are regular expressions (overrides other options).
ru: Искомая подстрока(-и) – регулярное выражение (замещает остальные параметры).

source: Keyword
ru: Искать

source: URL
ru: Ссылка

source: Title
ru: Название

source: Tags
ru: Теги

source: Description
ru: Описание

source: Delete tags list from existing tags
ru: Удалить список тегов из существующих

source: Bookmarks
ru: Закладки

source: Statistic
ru: Статистика

source: Duplicate URL
ru: Такая ссылка в базе уже есть

source: Rejected by the database
ru: База данных отказала в выполнении операции

source: <EMPTY TITLE>
ru: <БЕЗ НАЗВАНИЯ>

source: Entry
ru: Закладка

source: Index
ru: Номер

source: url invalid: %(url)s
ru: некорректная ссылка: %(url)s

source: Failed to create record.
ru: Ошибка создания записи.

source: Failed to delete record.
ru: Ошибка удаления записи.

source: Invalid search mode combination
ru: Некорректная комбинация фильтров поиска

source: Reordered bookmarks in DB
ru: Порядок закладок в БД был успешно изменён

source: netloc match
ru: на сайт

source: contain
ru: содержат

source: not contain
ru: не содержат

source: number equal
ru: количество равно

source: number not equal
ru: количество не равно

source: number greater than
ru: количество больше чем

source: number smaller than
ru: количество меньше чем

source: Failed to update record.
ru: Ошибка обновления записи.

source: <UNTAGGED>
ru: <БЕЗ ТЕГОВ>

# tag
source: Name
ru: Тег

# tag
source: Usage Count
ru: Число закладок

source: top most common
ru: самое распространённое

source: Pick another
ru: Показать другую

source: Swap record #{} with record #
ru: Поменять местами запись #{} с записью #

source: Not a valid record index: '{}'
ru: Некорректный номер строки: '{}'

source: There are only {} records in total!
ru: Всего существует только {} записей!

source: Swapping a record with itself has no effect!
ru: Попытка поменять запись местами саму с собой ничего не даст!

source: Random
ru: Случайная

source: Update indices to match this order
ru: Изменить порядок записей в БД на текущий

source: Reorder
ru: Изменить порядок

source: Save this order in DB?
ru: Сохранить закладки в БД в этом порядке?

source: Swap with…
ru: Поменять местами с…

source: Move down
ru: Сдвинуть вниз

source: Move up
ru: Сдвинуть вверх

source: Search bookmark
ru: Искать закладку

source: Bookmark manager like a text-based mini-web
ru: Менеджер закладок, как текстовая мини-сеть

source: Bookmarklet
ru: Букмарклет

source: Add to Buku
ru: Добавить в Buku

source: Note: if you select text on the page before activating the bookmarklet, it'll be used as description instead of page metadata.
ru: Заметка: если выделить текст на странице перед запуском букмарклета, он будет использован в качестве описания, вместо метаданных страницы.

source: Location Bar (keyboard-only) shortcut
ru: Ссылка для адресной панели (активация с клавиатуры)

source: in Firefox:
ru: в Firefox:

source: Open the bookmarks editor and set %(buku)s in the Keyword field of the bookmarklet.
ru: Откройте редактор закладок и введите %(buku)s в поле «Ключевое слово» закладки букмарклета.

source: in Chrome:
ru: в Chrome:

source: In %(path)s, add a new row by placing %(add_to_buku)s, %(buku)s, and the copied bookmarklet URL in respective fields).
ru: В меню %(path)s добавьте новую запись, введя %(add_to_buku)s, %(buku)s, и скопированную ссылку букмарклета в соответствующие поля).

source: Settings > Search engine > Manage… > Site Search
ru: Настройки > Поисковая система > Управление… > Поиск по сайту

source: usage:
ru: применение:

source: By hitting %(hotkey)s (thus switching to Location Bar), then typing %(buku)s and hitting %(enter)s, you'll be able to open the bookmarklet dialog via keyboard only.
ru: Нажав %(hotkey)s (и таким образом перейдя в адресную строку), введя туда %(buku)s и нажав %(enter)s, вы можете открыть окно букмарклета используя только клавиатуру.

source: Note: in Firefox this changes displayed URL, but you can reset it by switching back to Location Bar and hitting %(escape)s twice.
ru: Замечание: Firefox при этом меняет отображаемую ссылку; её можно восстановить перейдя обратно в адресную строку и нажав дважды %(escape)s.

source: FULL
ru: ПОЛНОЕ

source: Collect missing data (+extra tags) by fetching & parsing the webpage
ru: Собрать недостающие данные (+дополнительные теги) из скачанной страницы

source: Fetch
ru: Взять со страницы

# tags
source: name
ru: тег

# tags
source: usage count
ru: число закладок

# bookmarks
source: index
ru: номер

# bookmarks
source: url
ru: ссылка

# bookmarks
source: title
ru: название

# bookmarks
source: tags
ru: теги

# bookmarks
source: order
ru: порядок

source: Delete record
ru: Удалить запись

source: custom
ru: другой

source: Set custom page size (empty for default)
ru: Введите новый размер страницы (пустой = по умолчанию)

source: Invalid page size
ru: Некорректный размер страницы

source: {} days ago
ru: {} дней назад

source: {} hours ago
ru: {} часов назад

source: {} minutes ago
ru: {} минут назад

source: {} seconds ago
ru: {} секунд назад

source: just now
ru: только что

source: Data created
ru: Данные созданы

source: Refresh
ru: Обновить

source: Netloc
ru: Сайт

source: View all
ru: Все

source: Rank
ru: Ранг

source: Number
ru: Количество

source: (no netloc)
ru: (без сайта)

source: No bookmarks found.
ru: В базе данных нет закладок.

source: Netloc ranking
ru: Рейтинг сайтов

source: Tag
ru: Тег

source: No tags found.
ru: В базе данных нет тегов.

source: Tag ranking
ru: Рейтинг тегов

source: Title (common)
ru: Названия (повторяющиеся)

source: (no title)
ru: (без названия)

source: No common titles found.
ru: В базе данных нет закладок с повторяющимися названиями.

source: Common titles ranking
ru: Рейтинг повторяющихся названий

source: Original and replacement tags are the same.
ru: Для замены тега его имя нужно изменить.

source: Tag name cannot be blank.
ru: Имя тега не может быть пустым.

source: by index
ru: по номеру

source: by url
ru: по ссылке

source: by netloc
ru: по сайту

source: by title
ru: по названию

source: by description
ru: по описанию

source: by tags
ru: по тегам

source: with tag first
ru: сначала с тегом

source: with tag last
ru: сначала без тега

source: search
ru: поиск

source: search regex
ru: поиск по регулярному выражению

source: search deep
ru: глубокий поиск

source: search match all
ru: поиск всех совпадений

source: search match all, deep
ru: поиск всех совпадений, глубокий

source: search markers
ru: поиск с маркерами

source: search markers, regex
ru: поиск с маркерами, по регулярному выражению

source: search markers, deep
ru: поиск с маркерами, глубокий

source: search markers, match all
ru: поиск с маркерами, всех совпадений

source: search markers, match all, deep
ru: поиск с маркерами, всех совпадений, глубокий
